## Ejercicios repaso Pandas

In [10]:
lst1 = ['gato', 'perro', 'ratón', 'elefante', 'rinoceronte']
lst2 = [x for x in range(1,6)]

1. Convierte lst1 a un Series y lst2 a otro Series. Una vez creados, combinar los Series para crear un DataFrame

In [11]:
import pandas as pd
animales = pd.Series(lst1,name="Animal")
cantidad = pd.Series(lst2,name="Cantidad")

df = pd.concat([animales, cantidad],axis=1)
df

        Animal  Cantidad
0         gato         1
1        perro         2
2        ratón         3
3     elefante         4
4  rinoceronte         5

2. Renombra la Series basada en lst1 creada previamente a "animales"

In [12]:
animales.name = "animales"

3. Crea dos series de tamaño 10 con valores entre 1 y 10. Elimina del series1 los elementos que aparezcan en Series2

In [13]:
import numpy as np
serie1 = pd.Series(np.random.randint(1,11,(10)))
serie2 = pd.Series(np.random.randint(1,11,(10)))

serie1 = serie1[~serie1.isin(serie2)]
serie1

#df[~df.Cantidad.isin(serie1)]

0    8
1    6
3    8
4    9
5    9
6    8
7    7
dtype: int32

4. Obtén los elementos no comunes en ambas series

In [14]:
serie3 = pd.concat([serie1,serie2],ignore_index=True)
serie3[~serie3.duplicated(keep='first')]

0      8
1      6
3      9
6      7
7      5
8     10
9      3
10     2
12     1
14     4
dtype: int32

5. Obtén el mínimo y los percentiles 25, 50, 75 y 80 de la primera serie

In [38]:
infoSerie = serie1.describe([.25,.5,.75,.8]).loc[["min","25%","50%","75%"]]
print(infoSerie)

min    6.0
25%    7.5
50%    8.0
75%    8.5
dtype: float64

6. Obtén la frecuencia con la que se repite cada valor

In [40]:
serie1.value_counts()

0    8
1    6
3    8
4    9
5    9
6    8
7    7
dtype: int32

8    3
9    2
6    1
7    1
dtype: int64

7. Mantén el valor de los dos elementos más repetidos y al resto asignale el valor "Otros"

In [48]:
repetidos = serie1.value_counts()
repetidos.iloc[2:] = "Otros"
print(repetidos)

8        3
9        2
6    Otros
7    Otros
dtype: object

8. Crea un Series de tamaño 35 con valores aleatorios. Crea un DataFrame basado en este Series de dimensión 7 filas y 5 columnas

In [53]:
import numpy as np

serieRand = pd.Series(np.random.randint(1,101,(35)))
dfRand = pd.DataFrame(serieRand.values.reshape(7,5))
dfRand

    0   1   2    3   4
0  30  16  36   87  57
1  15  36  60   29  88
2  13  21  90   52  60
3  79  80   1   13  84
4  56  30   6   44   8
5  86  72  74   89  74
6  18  54  20  100  32

9. Partiendo de las series creadas en el *Ejercicio 1* apilar las dos series verticalmente.

In [61]:
pd.concat([animales,cantidad],ignore_index=True)

0           gato
1          perro
2          ratón
3       elefante
4    rinoceronte
5              1
6              2
7              3
8              4
9              5
dtype: object

10. Ahora apila horizontalmente

In [60]:
pd.concat([animales,cantidad],axis=1)

      animales  Cantidad
0         gato         1
1        perro         2
2        ratón         3
3     elefante         4
4  rinoceronte         5

11. Cómo convertir en mayúscula el primer caracter de Series de animales

In [73]:
animales = animales.apply(lambda x : x[0].upper()+x[1:])
print(animales)

0           Gato
1          Perro
2          Ratón
3       Elefante
4    Rinoceronte
Name: animales, dtype: object

12. Calcula el número de caracteres de cada elemento

In [89]:
numCar = animales.apply(lambda x: len(x))
df = pd.concat([animales,numCar],axis=1)
df.columns = ["Animales","Longitud"]

df

      Animales  Longitud
0         Gato         4
1        Perro         5
2        Ratón         5
3     Elefante         8
4  Rinoceronte        11

13. Calcula la diferencia entre los valores de cada elemento consecutivo del Series numérico

In [140]:
diferencia = abs(numCar[0:-1].values - numCar[1:].values)

print(diferencia)

[1 0 3 3]

14. Dada la lista siguiente de fechas, carga un Series de string a datetime
['2015-08-06T12:20', '2012-04-02', '2021/01/03', '20191121', '01-12-2015', '04 Jan 2007']

In [146]:
fechas = pd.Series(pd.to_datetime(['2015-08-06T12:20', '2012-04-02', '2021/01/03', '20191121', '01-12-2015', '04 Jan 2007']))
print(fechas)

0   2015-08-06 12:20:00
1   2012-04-02 00:00:00
2   2021-01-03 00:00:00
3   2019-11-21 00:00:00
4   2015-01-12 00:00:00
5   2007-01-04 00:00:00
dtype: datetime64[ns]

15. Obtén el día del año del Series anterior

In [148]:
print(fechas.dt.day_of_year)

0    218
1     93
2      3
3    325
4     12
5      4
dtype: int64

16. Obtén el día de la semana

In [150]:
print(fechas.dt.day_of_week)

0    3
1    0
2    6
3    3
4    0
5    3
dtype: int64

17. Crea un DataFrame basado en un Series de 10 elementos que se genere aleatoriamente entre "manzana", "plátano", "zanahoria" y pesos que sea un Series de 10 elementos aleatorios entre 1 y 10. Calcula la media del peso por fruta.

In [232]:
def frutasAleatorioas():
    fruta = ["manzana","platano","zanahoria"]
    lista = list()
    for i in range(10):
        lista.append(fruta[np.random.randint(0,len(fruta))])

    return pd.Series(lista)

df = pd.concat([frutasAleatorioas(), pd.Series(np.random.randint(1,11,(10)))], axis=1)
df.columns = ["Fruta", "Peso"]
df = df.groupby(["Fruta"]).mean()

df

           Peso
Fruta
manzana    5.75
platano    6.00
zanahoria  4.00

18. Crea un Series que contenga los 10 primeros lunes de 2022 como índice y un número aleatorio como valor

In [247]:
fechas = pd.Series(np.arange('2022-01', '2022-05', dtype='datetime64[D]'))
fechas = fechas[fechas.dt.weekday == 0].head(10)

fechas = pd.Series(np.random.randint(1,10,(fechas.size)),index=fechas)
fechas

2022-01-03    1
2022-01-10    6
2022-01-17    4
2022-01-24    3
2022-01-31    3
2022-02-07    1
2022-02-14    9
2022-02-21    6
2022-02-28    9
2022-03-07    5
dtype: int32

19. Crea un DataFrame basado en el Series del *Ejercicio 18* con las columnas llamadas fecha y precio

In [262]:
df = pd.DataFrame(fechas).reset_index()
df.columns = ["fecha","precio"]
df

       fecha  precio
0 2022-01-03       1
1 2022-01-10       6
2 2022-01-17       4
3 2022-01-24       3
4 2022-01-31       3
5 2022-02-07       1
6 2022-02-14       9
7 2022-02-21       6
8 2022-02-28       9
9 2022-03-07       5

20. Genera un DataFrame de 5x5 y posteriormente invierte el orden de los valores de sus filas

In [266]:
df = pd.DataFrame(np.random.randint(1,101,(5,5)))
print(df)

df.iloc[::-1]

    0   1   2   3   4
0  96  97  84  10  47
1  51   4  33  51  35
2  48  75  26  51  65
3   1   7  83  49  93
4  60  23  84  50  16

    0   1   2   3   4
4  60  23  84  50  16
3   1   7  83  49  93
2  48  75  26  51  65
1  51   4  33  51  35
0  96  97  84  10  47

21. Añade una nueva columna que sea el máximo entre el mínimo de cada fila

In [268]:
df["max/min"] = df.max(axis=1)/df.min(axis=1)
df

    0   1   2   3   4    max/min
0  96  97  84  10  47   9.700000
1  51   4  33  51  35  12.750000
2  48  75  26  51  65  23.214286
3   1   7  83  49  93  93.000000
4  60  23  84  50  16  14.451613